In [ ]:
import pandas as pd

# Craeting a datframe form dictionary

In [ ]:
# Create a dictionary 
StudentPythonMarks = { 'Name': ['Student1','Student2','Student3','Student4', 'Student5'],
                        'RegNo': [240001,240002,240003,240004,240005],
                        'Marks' : [45,78,89,23,90]
                     }

# Craeting a dataframe form dictionary
StudentPythonMarks_df = pd.DataFrame(StudentPythonMarks)

StudentPythonMarks_df

In [ ]:
# import required package
import requests 

url = "https://raw.githubusercontent.com/Kundan-Rwanda/sample-sales-data/refs/heads/main/products.json"

response = requests.get(url)
json_data = response.json()

#creating pandas dataframe form json

json_df = pd.DataFrame(json_data)
json_df

In [ ]:
json_df['Price'] = [100,200,300,400,500,600,700,800,900,1000,230,10]

In [ ]:
json_df

In [ ]:
json_df['UpdatedPrice'] = [233,4400,230,3400,4400,65675,77600,80000,999,2100,250,100]

In [ ]:
json_df

# create a new column incremetedPrice by 100

In [ ]:
json_df['incremetedPrice'] = json_df['UpdatedPrice'] + 100

In [ ]:
json_df['incremetedPriceByPercent'] = (((json_df['UpdatedPrice'] - json_df['Price']) / json_df['Price']) * 100).round(2)

In [ ]:
json_df

# Delete incrementedPice column

In [ ]:
json_df = json_df.drop('incremetedPrice',axis=1)

In [ ]:
json_df

# Slicing data using loc and iloc

# 1. loc : location

In [ ]:
json_df.loc[json_df['Price'] > 500] # returns all rows where price is greater than 500

In [ ]:
json_df.loc[4::,'Name'::2]

In [ ]:
json_df.loc[4::,'Name':'WeightGrams':2] # In loc, first value is inclusive and second value is exclusive

In [ ]:
len(json_df)

In [ ]:
json_df.loc[11]

In [ ]:
new_price_df = (json_df['UpdatedPrice'] *105)/100
new_price_df

# apply() function

In [ ]:
json_df['UpdatedPrice'].apply(lambda x: x * 105 / 100)

In [ ]:
json_df

In [ ]:
json_df.loc[1::, ] # Index Slicing is only possible in loc on rows  ???? do a research on this

In [ ]:
json_df['UpdatedPrice'] = new_price_df

In [ ]:
json_df

# 2. iloc : Integer location
- iloc uses integer positions

In [ ]:
json_df

In [ ]:
json_df.iloc[2::, 1::2]

# Dataframe Merge

In [ ]:
df1 = json_df.iloc[::, :500]

In [ ]:
df2 = json_df.iloc[::, 600:1000]

In [123]:
customer_df = pd.read_csv("D:\\datasets\\coh7\\Customer.csv")
customer_df

   ID     Name  Age  Product_ID Purchased_Product       City
0   1   Olivia   20         101             Watch     Mumbai
1   2   Aditya   25           0                Na      Delhi
2   3     Cory   15         106               Oil  Bangalore
3   4  Isabell   10           0               NaN    Chennai
4   5  Dominic   30         103             Shoes    Chennai
5   6    Tyler   65         104        Smartphone      Delhi
6   7   Samuel   35           0               NaN    Kolkata
7   8   Daniel   18           0               NaN      Delhi
8   9   Jeremy   23         107            Laptop     Mumbai

# Product dataframe

In [119]:
product_df = pd.read_csv("D:\\datasets\\coh7\\Product.csv")
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

### Inner merge
- on

In [106]:
pd.merge(product_df,customer_df,on='Product_ID')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,Laptop,Mumbai

### Inner merge
- left_on
- right_on

In [107]:
pd.merge(product_df,customer_df,left_on='Product_Name',right_on='Purchased_Product')

,Product_ID_x,Product_Name,Category,Price,Seller_City,ID,Name,Age,Product_ID_y,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,101,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,103,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,104,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,106,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,107,Laptop,Mumbai

## Full Merge
- how (outer,inner)
- on

In [131]:
pd.merge(product_df,customer_df,on='Product_ID',how='outer')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi
1,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai
2,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata
3,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi
4,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
5,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN
6,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
7,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
8,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
9,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
10,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

- indicator

In [ ]:
mdf = pd.merge(product_df,customer_df,on='Product_ID',how='outer',indicator=True)
mdf

- validate (pre-process)

In [142]:
# mdf_oneToOne = pd.merge(product_df,customer_df,on='Product_ID',how='outer',validate='1:1')
# mdf_oneToOne
mdf_oneToMany = pd.merge(product_df,customer_df,on='Product_ID',how='outer',validate='1:m')
mdf_oneToMany

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi
1,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai
2,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata
3,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi
4,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
5,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN
6,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
7,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
8,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
9,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
10,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

In [127]:
pd.merge(product_df,customer_df,on='Product_ID',how='inner')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,Laptop,Mumbai

### Left Merge
- on
- how

In [115]:
pd.merge(product_df,customer_df,on='Product_ID',how='left')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

### Right Merge
- on
- how

In [118]:
pd.merge(product_df,customer_df,on='Product_ID',how='right')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,0,NaN,NaN,NaN,NaN,2,Aditya,25,Na,Delhi
2,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
3,0,NaN,NaN,NaN,NaN,4,Isabell,10,NaN,Chennai
4,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
5,104,Smartphone,Electronics,14999.0,Klokata,6,Tyler,65,Smartphone,Delhi
6,0,NaN,NaN,NaN,NaN,7,Samuel,35,NaN,Kolkata
7,0,NaN,NaN,NaN,NaN,8,Daniel,18,NaN,Delhi
8,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

# 1. Read abount Concantenation (HomeWork)

# 2. Given the bellow dataset , Calculate the Revenue of the country
- https://github.com/Kundan-Rwanda/sample-sales-data
- use merge